#ifndef __CALMAN_H__
#define __CALMAN_H__
#include <stdio.h>

/*20кГц в режиме SOC_ADC_SAMPLE_FREQ_THRES_LOW*/
#define CALMAN_DT (float)0.00005
#define CALMAL_ALPHA (float)0.85
#define CALMAN_BETTA (float)0.005
#define CALMAN_START_VAL 0
#define CALMAN_START_SPEED 0
/*
- Обычно коэффициент a выбирают таким образом, чтобы учитывать
динамику системы и шумы модели. Значение a должно находиться
в диапазоне от 0 до 1, где более близкое к 1 значение означает
большую доверительность в модель. Если a близко к 0, то это
означает, что текущее измерение сильно влияет на новое состояние,
что может привести к большему шуму. Если a близко к 1, то это означает,
что предыдущее состояние сильно влияет на новое состояние, что может
привести к медленной адаптации к изменяющимся условиям.
- Коэффициент b учитывает шум измерения и может быть подобран
путем экспериментов и анализа статистики шума. Значение b может
быть увеличено, чтобы учитывать больший шум измерения, или уменьшено,
чтобы уменьшить влияние шума на оценку состояния.
*/
float AlphaBettaFiltr(float xm);
#endif //__CALMAN_H__